# language: ru
Функционал: Вход и выход
  Сценарий: Вход и выход
    Пусть запущен тестовый сервис
    Когда открыт браузер
    И введен url веб-приложения
    То открыта стартовая страница
   # Когда выбран новый продукт
  #  То "новые условия" соответствуют новому продукту
  #  Когда пополнен счет на сумму подключения нового продукта
  #  То баланс увеличился на сумму пополнения
  #  И кнопка "Подключить" активна
  #  Когда нажата кнопка "Подключить"
  #  То баланс уменьшился на стоимость продукта
  #  И "текущие условия" соответствуют подключенному продукту
  #  Когда нажата кнопка "Сброс"
  #  То баланс равен 0
  #  И "текущие условия" соответствуют нулевому продукту
  #  И "новые условия" соответствуют нулевому продукту



